{"extracted_information": "The article 'Creating Accessible UI Animations' by Oriana García details Mercado Libre's approach to designing inclusive UI animations. It emphasizes balancing enhancing user experiences with accommodating users sensitive to motion, such as those with vestibular disorders, attention disorders, or photosensitive epilepsy.\n\n**User Considerations & Why Accessibility is Important:**\n*   Animations, when excessive, can cause discomfort, hinder focus for those with attention disorders, or trigger physical symptoms like nausea, dizziness, and headaches (vestibular disorders) due to inner ear sensitivity.\n*   Certain visual stimuli can cause seizures in individuals with photosensitive epilepsy.\n*   It's crucial to consider 'all' users, not just those who find animations enjoyable.\n\n**Research & Foundational Lessons:**\n1.  **Animation ≠ Motion:** While all moving elements are animations, not all animated elements involve a change in position. This distinction is key for accessibility.\n2.  **Rely on Reduced Motion Preferences:** The `prefers-reduced-motion` media query allows configuring animations to respect user preferences (e.g., MacOS 'Reduce motion' setting).\n\n**WCAG Criteria Related to Motion:**\n*   **Success Criterion 2.2.2 (Level AA) - Pause, Stop, Hide:** Users should be able to pause, stop, or hide content that moves, flashes, or scrolls, especially if it auto-starts/updates or lasts over five seconds.\n*   **Success Criterion 2.3 (Level A/AAA) - Moving or Flashing Elements:** Avoid intermittent animations flashing more than three times per second to prevent seizures (2.3.1 Level A, 2.3.2 Level AAA).\n*   **Success Criterion 2.3.3 - Animation from Interactions:** Users should interact with UI without solely relying on animations, meaning movements should be stoppable unless essential for functionality or information.\n\n**Implementation Strategies & Design Patterns (Mercado Libre's Action Plan):**\nMercado Libre classified animations into three groups based on WCAG criteria and the animation vs. motion distinction:\n\n1.  **Animations That Do Not Meet The Criteria (Safe):** These do not involve motion and require no adjustments. They do not trigger vestibular disorders or impact reduced motion preferences.\n    *   **Examples:** Objects that instantly appear/disappear without transitions, elements that change color or opacity (e.g., a button changing color on hover), provided there's sufficient contrast.\n\n2.  **Unessential Animations That Can Be Removed:** These animations contain motion but are not crucial for understanding the interface. They are completely removed when `prefers-reduced-motion` is enabled.\n    *   **Characteristics:** Take up >1/3 of the screen or move significantly, autoplay/auto-update, parallax effects, multidirectional movements (Z-axis), flashes/looping, vortex/scaling/zooming/blurring effects, animated illustrations (e.g., morphing SVGs).\n    *   **Strategies:** Replace smooth transitions with instant ones for large movements; remove autoplay/auto-update from carousels/videos; eliminate horizontal sliding effects; display static versions of animated illustrations.\n\n3.  **Essential Animations That Can Be Adapted:** These animations are necessary for UI understanding but can be adjusted to be more accessible.\n    *   **Strategy:** Provide alternative, more subtle animations when reduced motion is preferred. This often involves adjusting or reducing the intensity.\n    *   **Example (Loading Indicator Case Study):**\n        *   **Problematic aspects:** Fast rotation, constant scaling, infinite loop.\n        *   **Accessible adaptation:** Reduce rotation speed, eliminate scaling effect, set maximum duration to five seconds.\n        *   **Principle:** Animation can be necessary and mindful of reduced motion preferences simultaneously.\n\n**Integration & Education:**\n*   The defined reduced motion preferences were integrated into Mercado Libre's design system.\n*   **Approach:** Documenting the design system, creating centralized resources, educating teams on motion criteria, achieving accessibility, and user benefits.\n*   Addressing technical aspects: When the design system automatically adapts versus when product teams need to tailor experiences.\n*   Initiating training and awareness campaigns through company-wide presentations and articles.\n\n**Key Principle:** A design system is an ideal platform for global feature application and fostering teamwork/consistency, especially for accessibility.\n\n**References/Further Reading:**\n*   “Designing Safer Web Animation For Motion Sensitivity” by Val Head (alistapart.com)\n*   “Accessibility for Vestibular Disorders” by Facundo Corradini (alistapart.com)\n*   “Animation for Attention and Comprehension” by Aurora Harley (nngroup.com)\n*   “Animation and motion” (web.dev)\n*   “How to Make Motion Design Accessible” by Alik Brundrett (uxpamagazine.org)\n*   “Designing With Reduced Motion For Motion Sensitivities” by Val Head (smashingmagazine.com)\n*   “Responsive Design for Motion” by James Craig (webkit.org)", "specifications": {}, "pricing": {}, "features": ["Distinction between animation and motion", "Usage of `prefers-reduced-motion` media query", "Classification of animations into three groups: non-criteria, unessential, essential", "Guidance on adapting essential animations (e.g., loading indicators)", "Integration into design systems", "Educational approach for teams"], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": ["https://alistapart.com/article/designing-safer-web-animation-for-motion-sensitivity/", "https://alistapart.com/article/accessibility-for-vestibular/", "https://www.nngroup.com/articles/animation-usability/", "https://web.dev/learn/accessibility/motion/", "https://uxpamagazine.org/how-to-make-motion-design-accessible/", "https://www.smashingmagazine.com/2020/09/design-reduced-motion-sensitivities/#identifying-potentially-triggering-motion", "https://webkit.org/blog/7551/responsive-design-for-motion/", "https://www.w3.org/TR/WCAG22/#pause-stop-hide", "https://www.w3.org/TR/WCAG22/#seizures-and-physical-reactions", "https://www.w3.org/TR/WCAG22/#animation-from-interactions", "https://mercadolibre.com/", "https://vestibular.org/article/diagnosis-treatment/types-of-vestibular-disorders/", "https://medium.com/mercadolibre-tech/accessibility/home", "https://caniuse.com/prefers-reduced-motion", "https://css-tricks.com/revisiting-prefers-reduced-motion/#aa-reduce-isnt-necessarily-remove"]}