{"extracted_information": "Apple's Human Interface Guidelines provide comprehensive accessibility recommendations to create inclusive app experiences for users with various capabilities. Key areas include ensuring perceivable, intuitive, and adaptable interfaces.", "specifications": {"text_sizing": {"dynamic_type_enlargement": "Ideally, give people the option to enlarge text by at least 200% (or 140% in watchOS apps).", "minimum_default_type_sizes": {"iOS_iPadOS": {"default_size": "17 pt", "minimum_size": "11 pt"}, "macOS": {"default_size": "13 pt", "minimum_size": "10 pt"}, "tvOS": {"default_size": "29 pt", "minimum_size": "23 pt"}, "visionOS": {"default_size": "17 pt", "minimum_size": "12 pt"}, "watchOS": {"default_size": "16 pt", "minimum_size": "12 pt"}}, "font_weight_impact": "Thicker weights are easier to read for smaller font sizes. Consider increasing font size when using a thin weight."}, "color_contrast": {"standards": "Web Content Accessibility Guidelines (WCAG) and Accessible Perceptual Contrast Algorithm (APCA). Accessibility Inspector uses WCAG Level AA guidance.", "minimum_contrast_ratios_wcag_aa": {"up_to_17_pts_all_weight": "4.5:1", "18_pts_all_weight": "3:1", "all_bold_weight": "3:1"}, "high_contrast_mode": "If minimum contrast not met by default, ensure higher contrast color scheme when 'Increase Contrast' system setting is on.", "dark_mode_consideration": "Check minimum contrast in both light and dark appearances."}, "touch_targets": {"minimum_control_sizes": {"iOS_iPadOS": {"default_size": "44x44 pt", "minimum_size": "28x28 pt"}, "macOS": {"default_size": "28x28 pt", "minimum_size": "20x20 pt"}, "tvOS": {"default_size": "66x66 pt", "minimum_size": "56x56 pt"}, "visionOS": {"default_size": "60x60 pt", "minimum_size": "28x28 pt"}, "watchOS": {"default_size": "44x44 pt", "minimum_size": "28x28 pt"}}, "padding_between_controls": {"with_bezel": "About 12 points of padding.", "without_bezel": "About 24 points of padding around visible edges."}}}, "pricing": {}, "features": [], "statistics": {}, "temporal_info": {"change_log": [{"date": "June 9, 2025", "changes": "Added guidance and links for Assistive Access, Switch Control, and Accessibility Nutrition Labels."}, {"date": "March 7, 2025", "changes": "Expanded and refined all guidance. Moved Dynamic Type guidance to the Typography page, and moved VoiceOver guidance to a new VoiceOver page."}, {"date": "June 10, 2024", "changes": "Added a link to Apple’s Unity plug-ins for supporting Dynamic Type."}, {"date": "December 5, 2023", "changes": "Updated visionOS Zoom lens artwork."}, {"date": "June 21, 2023", "changes": "Updated to include guidance for visionOS."}]}, "geographical_data": {}, "references": [], "accommodations": {"vision": {"text_sizing": "Support larger text sizes (Dynamic Type), use recommended defaults for custom type sizes, consider font weight impact.", "color_contrast": "Meet minimum color contrast standards (WCAG Level AA guidance), prefer system-defined colors, check in Dark Mode.", "information_conveyance": "Convey information with more than color alone (e.g., visual indicators like distinct shapes/icons).", "screen_readers": "Describe app's interface and content for VoiceOver."}, "hearing": {"audio_alternatives": "Support text-based ways for audio/video (Captions, Subtitles, Audio descriptions, Transcripts).", "haptics": "Use haptics in addition to audio cues (e.g., success chime, error sound, Music Haptics, Audio graphs).", "visual_cues": "Augment audio cues with visual cues (especially for off-screen important content)."}, "motor": {"control_sizing_and_spacing": "Offer sufficiently sized controls (minimum control sizes provided per platform), include enough padding between elements.", "gesture_alternatives": "Support simple gestures for common interactions, offer alternatives to gestures (e.g., button tap instead of swipe), avoid complex multifinger/multihand gestures.", "voice_control": "Let people use Voice Control for guidance and verbal input; label interface elements appropriately.", "siri_shortcuts": "Integrate with Siri and Shortcuts for voice-activated tasks.", "assistive_technologies": "Support mobility-related assistive technologies: VoiceOver, AssistiveTouch, Full Keyboard Access, Pointer Control, Switch Control."}, "keyboard_navigation": {"full_keyboard_access": "Let people use the keyboard alone to navigate and interact; avoid overriding system-defined keyboard shortcuts.", "switch_control": "Support Switch Control for navigation using separate hardware, game controllers, or sounds."}, "cognitive": {"simplicity": "Minimize complexity, keep actions simple and intuitive, prefer system gestures/behaviors.", "time_management": "Minimize use of time-boxed interface elements; prefer dismissing views with explicit action.", "game_difficulty": "Consider offering difficulty accommodations in games (e.g., customizable difficulty, reduced criteria, adjusted reaction time, control assistance).", "media_playback": "Let people control audio and video playback (avoid autoplay, provide discoverable controls, global opt-out).", "flashing_lights": "Allow people to opt out of flashing lights in video playback (Dim Flashing Lights setting).", "animations": "Be cautious with fast-moving and blinking animations; respond to 'Reduce Motion' setting by reducing automatic/repetitive animations (e.g., tightening springs, tracking gestures directly, avoiding depth changes, using fades, avoiding blur animations).", "assistive_access": "Optimize UI for Assistive Access: identify core functionality, remove noncritical workflows, break up multistep workflows, confirm difficult-to-recover actions twice."}}}