{"extracted_information": "Detailed information about the spiritual significance of various colors in biblical and Christian contexts is provided, including primary and secondary colors and an extended list of meanings.", "specifications": {}, "pricing": {}, "features": [{"color": "Red", "meaning": "In Hebrew, 'Oudem' (red clay), associated with flesh and mankind (Adam, Esau, Edom). Spiritually represents the Blood of Jesus, love of God, blood of lamb, atonement, salvation."}, {"color": "Yellow", "meaning": "Associated with fire and purification processes, as seen in trials of faith (I Peter 1:7). Spiritually represents Faith and Glory of God, anointing, joy."}, {"color": "Blue", "meaning": "Signifies the Healing Power of God, the Word of God (Numbers 15:38-41), presence of Yahweh (Sky), and God's chosen nation Israel. Garment hem (Matt 9:21) was blue. Spiritually represents Heaven, the Holy Spirit, authority."}, {"color": "Green", "meaning": "Obtained by mixing yellow (trials) and blue (Word of God). Biblically means immortality (Psalm 1:3), resurrection (Spring). Spiritually represents Praise, growth, prosperity, new beginning, flourishing, restoration."}, {"color": "Orange", "meaning": "Obtained by mixing red (flesh) and yellow (trials). Represents the Fire of God, deliverance, and passionate praise."}, {"color": "Purple", "meaning": "Obtained by mixing red (flesh) and blue (Word of God). Represents royalty or priesthood. Spiritually represents Priesthood, kingship, royalty, mediator, wealth."}, {"color": "Amber", "meaning": "Glory of God, judgment upon sin, endurance."}, {"color": "Pink/Fuchsia", "meaning": "Right relationship with God."}, {"color": "Scarlet", "meaning": "Royalty, fine linen for tabernacle."}, {"color": "Gold", "meaning": "Glory, divinity, kingship, eternal deity, foundation, altar, beauty, precious, holiness, majesty, righteousness."}, {"color": "Wine", "meaning": "New birth, multiply, overflow."}, {"color": "Sapphire", "meaning": "Law, commandments, grace, the Holy Spirit, divine revelation."}, {"color": "Turquoise", "meaning": "River of God, sanctification, healing, New Jerusalem."}, {"color": "Silver", "meaning": "Word of God, purity, divinity, salvation, truth, atonement, redemption."}, {"color": "White", "meaning": "Bride of Christ, surrender, harvest, light, righteousness, conquest, victory, blessedness, joy, angels, saints, peace, completion, triumph."}, {"color": "Brown", "meaning": "End of season, rags, people, pride, weary, faint."}, {"color": "Black", "meaning": "Darkness, sin, Earth, affliction, humiliation, calamity, death, mourning."}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": []}