{"extracted_information": "Detailed color contrast requirements based on WCAG 2.0 and WCAG 2.1, including specific ratios for AA and AAA compliance, definitions for large text, and methods/considerations for testing various elements.", "specifications": {"contrast_ratio_definition": "A measure of the difference in perceived luminance or brightness between two colors, expressed as a ratio ranging from 1:1 (e.g., white on white) to 21:1 (e.g., black on white).", "large_text_definition": {"points": "18pt and larger, or 14pt and larger if it is bold.", "pixels": "18pt maps to 24 pixels, 14pt maps to approximately 18.67 pixels.", "css_bold": "font-weight:bold, or font-weight:700 or greater."}, "wcag_2_0_contrast_minimum_1_4_3_level_aa": {"text_and_images_of_text_ratio": "4.5:1", "large_text_ratio": "3:1", "exceptions": ["Incidental (inactive user interface component, pure decoration, not visible, or part of a picture with significant other visual content)", "Logotypes (text part of a logo or brand name)"]}, "wcag_2_0_contrast_enhanced_1_4_6_level_aaa": {"normal_text_ratio": "7:1", "large_text_ratio": "4.5:1"}, "wcag_2_1_non_text_contrast_1_4_11_level_aa": {"requirement_ratio": "3:1 against adjacent color(s)", "applies_to": ["User Interface Components (visual information required to identify components and states)", "Graphical Objects (parts of graphics required to understand the content)"], "exceptions": ["Inactive components", "Where the appearance of the component is determined by the user agent and not modified by the author", "When a particular presentation of graphics is essential to the information being conveyed (e.g., heat maps, real-life imagery, logos)"]}}, "pricing": {}, "features": [{"criterion": "1.4.3 Contrast (Minimum) (Level AA)", "description": "Visual presentation of text and images of text must have a contrast ratio of at least 4.5:1, with an exception for large text which requires 3:1. Exceptions also include incidental text/images and logotypes.", "testing_considerations": ["Applies to text within graphics (images of text).", "Text effects like outlines or halos can impact perceived contrast; outline color can be text color, halo color can be background color for measurement.", "For text over gradients, semi-transparent colors, and background images, test the area where contrast is lowest.", "Text in interactive states (hover, focus, active) must meet contrast requirements independently and be evaluated in each state."]}, {"criterion": "1.4.6 Contrast (Enhanced) (Level AAA)", "description": "More stringent contrast requirements than Level AA: 7:1 for normal text and 4.5:1 for large text. Although higher contrast is recommended, Level AA is the common legal requirement."}, {"criterion": "1.4.11 Non-text Contrast (Level AA) (WCAG 2.1)", "description": "Requires visual information for user interface components and graphical objects to have a contrast ratio of at least 3:1 against adjacent colors. This means contrast may need to be measured in multiple places (e.g., different sides of an element or between its internal components).", "specific_applications": ["User Interface Components: Controls for distinct functions, including each state (e.g., hover, focus) must have 3:1 contrast.", "Graphical Objects: Elements 'required to understand the content' must meet 3:1 contrast. If descriptive text is present, the graphical object may be exempt."]}, {"criterion": "1.4.1 Use of Color (Level A)", "description": "Prohibits using color alone as the only visual means of conveying information, indicating an action, prompting a response, or distinguishing a visual element. Additional visual cues (e.g., text labels, icons, underlines) must be provided.", "application_to_links": "When color is the only way to identify a link (e.g., underline removed from body text links): \n  1. Must have 3:1 contrast between the body text and the link text. \n  2. A visual cue (not just a color change) must appear on keyboard focus (and recommended mouse hover), typically an underline. \n  These conditions are in addition to the 4.5:1 contrast requirement for the link text with its background."}], "statistics": {"contrast_ratio_range": "1:1 to 21:1"}, "temporal_info": {"wcag_2_1_publication_date": "June 2018"}, "geographical_data": {}, "references": ["https://www.w3.org/TR/WCAG21/#contrast-minimum", "https://www.w3.org/TR/WCAG21/#contrast-enhanced", "https://www.w3.org/TR/WCAG21/#non-text-contrast", "https://www.w3.org/TR/WCAG21/#use-of-color", "/techniques/skipnav/", "https://www.w3.org/TR/WCAG21/#focus-visible"]}