{"extracted_information": "The content presents 27 design guidelines for mobile applications tailored for older adults (aged ≥60 years), derived from a systematic review of scientific literature published between 2010 and 2021. The guidelines address usability challenges related to physical and cognitive changes associated with aging, aiming to bridge the digital divide and support user-centered design. The recommendations are categorized into two 'Golden Rules' and five main categories: Help & Training, Navigation, Visual Design, Cognitive Load, and Interaction.", "specifications": {"font_sizes": {"general_recommendation": "Use large font sizes, as visual acuity diminishes with age.", "specific_recommendations": [{"source": "Harte et al. [36]", "detail": "At least 10 points (Didot system) for simple interface elements."}, {"source": "Morey et al. [41]", "detail": "At least 30 points for critical text, and at least 20 points for secondary text."}], "note": "There is no current consensus on the exact minimum font size; further research through usability testing is needed."}, "interactive_control_sizes_and_spacing": {"general_recommendation": "Augment the size of interactive controls (e.g., buttons or form entries) and ensure large spacing between them to facilitate interaction and avoid accidental tapping. If possible, define a touch area that exceeds the visual component."}, "color_contrast_requirements": {"general_recommendation": "Provide high contrast between foreground and background color. This helps older users read text due to diminished visual acuity and can benefit a broad range of users in various viewing conditions (e.g., low brightness)."}, "vibration_feedback_effectiveness": {"detail": "Effectiveness for older users is unclear. Studies suggest the ability to perceive vibrations is diminished in users aged >50 years, making it less effective than visual or auditory feedback. Not to be used as the primary feedback method.", "references": ["[90] Huppert", "[39] de Almeida et al.", "[58] Leitão and Silva"]}}, "pricing": {}, "features": [{"category": "Golden Rules", "guidelines": [{"name": "Simplify", "description": "Simplify the product concept and any element users need to understand to successfully operate the mobile app. This addresses cognitive difficulties experienced by older users and relates to higher user experience (UX)."}, {"name": "Increase the size and distance between interactive controls", "description": "Augment the size of interactive controls (e.g., buttons or form entries) and ensure large spacing to facilitate interaction and avoid accidental tapping due to motor limitations. The touch area should exceed the visual component if possible."}]}, {"category": "Help & Training", "guidelines": [{"name": "Provide initial training, if possible face to face", "description": "Offer a face-to-face demonstration before first use, especially for critical apps (health, finance), as older users may lack familiarity with technology and written documentation might be insufficient."}, {"name": "Favor video tutorials", "description": "When learning to use an app, help should be offered through video tutorials. Written instructions can complement but should not stand alone, as older users may tire easily from lengthy text and may have low literacy levels."}, {"name": "Provide contextualized help and step-by-step instructions", "description": "Guidance for complex tasks should be structured and accessible. Contextual help should focus on the visible interface, avoiding time-consuming searches in help subsystems."}]}, {"category": "Navigation", "guidelines": [{"name": "Simplify the navigation, reduce the number of alternative paths", "description": "Design simple navigation with few rules, reducing complexity and the number of optimal paths to prevent older users with cognitive difficulties from getting lost."}, {"name": "Provide a safe exit in any screen", "description": "Ensure every screen includes a clear exit (e.g., return function, back button, or cancel option) to alleviate anxiety when users are unsure what to do."}, {"name": "Maintain focus on the current action", "description": "Help users concentrate by not displaying secondary functions. Attract attention to the most important or typical button for the next step to ease progression and avoid navigation difficulties."}]}, {"category": "Visual Design", "subcategories": [{"name": "Layout", "guidelines": [{"name": "Avoid locating controls close to the edge of the screen", "description": "Position interactive elements away from the screen edge to prevent involuntary interactions."}, {"name": "Reduce the number of available elements and options in the screen", "description": "Simplify the layout, even at the expense of functionality, as simpler layouts lead to better UX for older adults and support the 'Simplify' golden rule."}]}, {"name": "Icons", "guidelines": [{"name": "Use icons that are concrete and familiar images", "description": "Avoid abstract icons; instead, use real-world representations or graphical content meaningful to older users (e.g., medication package pictures)."}, {"name": "Add labels to icons", "description": "Improve understandability and user performance by adding textual support that clearly represents the icon's purpose."}, {"name": "Use semantically close icons", "description": "Minimize the semantic distance between an icon and its function to positively impact recognition by older people."}]}, {"name": "Appearance", "guidelines": [{"name": "Use large font sizes", "description": "Compensate for diminished visual acuity by ensuring font sizes are sufficiently large and visible."}, {"name": "Clearly show which elements are touchable", "description": "Enhance the difference between interactive and non-interactive elements with clear boundaries and interaction cues, as older users may not be familiar with conventional affordances or may experience cognitive strain."}, {"name": "Provide high contrast between foreground and background color", "description": "Ensure strong contrast between text and background colors to aid readability for users with diminished visual acuity, benefiting a broad range of users."}]}]}, {"category": "Cognitive Load", "guidelines": [{"name": "Use simple, familiar, and unambiguous language", "description": "Employ clear feedback and avoid technical terms or ambiguous language, recognizing that older users may lack familiarity with technology and the heuristics for interpreting UIs."}, {"name": "Do not assume users’ familiarity with conventional symbols", "description": "Create symbols that are universally understandable and culturally appropriate, rather than relying on common digital conventions (e.g., '?' for help, '→' for send)."}, {"name": "Keep instructions and messages short", "description": "Minimize cognitive effort by providing concise instructions and text to avoid overwhelming older users."}]}, {"category": "Interaction", "subcategories": [{"name": "Input Methods", "guidelines": [{"name": "Favor control tapping over gesture interactions", "description": "Prioritize direct manipulation via single taps over gestures, as gestures require advanced motor skills and can be difficult for older users with tremors or dexterity issues."}, {"name": "When using gesture interaction as input method, avoid complex gestures", "description": "Complex gestures are difficult to remember and perform accurately, especially for older users due to skin aging, wrinkling, or hand tremors, leading to incorrect interpretation by the system."}, {"name": "Minimize the use of keyboard", "description": "Reduce reliance on virtual keyboards, which require fine motor abilities. Consider voice input as an alternative."}, {"name": "Consider reducing touch sensitivity", "description": "Adjust touch sensitivity to prevent involuntary taps, allowing older users to move their hands over the screen with less fear of accidental interaction."}]}, {"name": "Output Methods", "guidelines": [{"name": "If possible, provide multisensory feedback", "description": "Increase the likelihood of message reception by offering feedback through multiple senses (visual, auditory, haptic) to accommodate perception limitations."}, {"name": "Show clear feedback after control tapping, as subtle feedback might not be noticed", "description": "Provide bold and explicit interaction feedback in response to user actions, as subtle changes (e.g., color change of a pressed button) may be missed."}, {"name": "Do not rely on vibration as the primary way of providing feedback", "description": "Vibration perception may be diminished in older adults, making it an unreliable primary feedback mechanism, though it can complement other forms of feedback."}, {"name": "Increase response time, time for feedback information, and time-outs", "description": "Allow sufficient time for older users to process on-screen information, interpret content, and decide on their next action, accommodating age-related decline in information processing speed."}]}]}], "statistics": {}, "temporal_info": {"review_period": "2010 to 2021"}, "geographical_data": {}, "references": [{"id": "36", "title": "Human-centered design study: enhancing the usability of a mobile phone app in an integrated falls risk detection system for use by older adult users.", "authors": "Harte R, Quinlan LR, Glynn L, Rodríguez-Molinero A, Baker PM, Scharf T, ÓLaighin G.", "journal": "JMIR Mhealth Uhealth.", "year": "2017"}, {"id": "37", "title": "User evaluation of an app for liquid monitoring by older adults.", "authors": "Sani Z, Petrie H.", "conference": "Proceedings of the 11th International Conference on Universal Access in Human–Computer Interaction; UAHCI '17; July 9–14, 2017; Vancouver, BC.", "year": "2017"}, {"id": "39", "title": "Recommendations for the development of web interfaces on tablets/iPads with emphasis on elderly users.", "authors": "de Almeida RX, Ferreira SB, Soares HP.", "journal": "Procedia Comput Sci.", "year": "2015"}, {"id": "41", "title": "Mobile health apps: improving usability for older adult users.", "authors": "Morey SA, Stuck RE, Chong AW, Barg-Walkow LH, Mitzner TL, Rogers WA.", "journal": "Ergon Des.", "year": "2019"}, {"id": "4", "title": "Characteristics of elderly user behavior on mobile multi-touch devices.", "authors": "Harada S, Sato D, Takagi H, Asakawa C.", "conference": "Proceedings of the 14th IFIP TC 13 International Conference on Human-Computer Interaction; INTERACT '13; September 2-6, 2013; Cape Town, South Africa.", "year": "2013"}, {"id": "16", "title": "Design of mobile phones for older adults: an empirical analysis of design guidelines and checklists for feature phones and smartphones.", "authors": "Petrovčič A, Taipale S, Rogelj A, Dolničar V.", "journal": "Int J Hum Comput Interact.", "year": "2018"}, {"id": "58", "title": "Target and spacing sizes for smartphone user interfaces for older adults: design patterns based on an evaluation with users.", "authors": "Leitão R, Silva P.", "conference": "Proceedings of the 19th Conference on Pattern Languages of Programs; PLoP '12; October 19-21, 2012; Tucson, Arizona.", "year": "2012"}, {"id": "80", "title": "Research-derived web design guidelines for older people.", "authors": "Kurniawan S, Zaphiris P.", "conference": "Proceedings of the 7th international ACM SIGACCESS conference on Computers and accessibility; Assets '05; October 9-12, 2005; Baltimore, MD.", "year": "2005"}, {"id": "89", "title": "How can we improve the interaction of older users with devices?", "authors": "Soares Guedes L, Ribeiro CC, Ounkhir S.", "conference": "Proceedings of the 9th International Conference on Software Development and Technologies for Enhancing Accessibility and Fighting Info-exclusion; DSAI '20; December 2-4, 2020; Virtual Event.", "year": "2020"}, {"id": "90", "title": "Designing for older users.", "authors": "Huppert F.", "book": "Inclusive Design: Design for the Whole Population", "year": "2003"}]}