{"extracted_information": "WCAG Success Criterion 2.5.1, Level A, mandates that all functionality operated by multipoint or path-based gestures must also be operable with a single pointer without a path-based gesture, unless the complex gesture is essential. This ensures accessibility for users who cannot perform precise or complex movements, or who use alternative input devices. It requires providing simple single-point alternatives like taps, clicks, or buttons for interactions typically requiring pinch-to-zoom, specific swiping motions, or multi-finger gestures. The criterion specifically addresses challenges for individuals with motor impairments, enabling control via devices such as head pointers, eye-gaze systems, or speech-controlled mouse emulators.", "specifications": {"success_criterion": {"id": "2.5.1", "name": "Pointer Gestures", "level": "A", "requirement": "All functionality that uses multipoint or path-based gestures for operation can be operated with a single pointer without a path-based gesture, unless a multipoint or path-based gesture is essential.", "applicability_note": "This requirement applies to web content that interprets pointer actions (i.e., this does not apply to actions that are required to operate the user agent or assistive technology)."}, "key_terms": {"path_based_gesture": "An interaction where not just the endpoints matter, but how the pointer moves between these points (e.g., swiping, drawing specific shapes).", "multipoint_gesture": "Gestures requiring two or more pointer inputs (e.g., two-finger pinch zoom, split tap, two- or three-finger tap or swipe).", "single_pointer": "An input modality that only targets a single point on the page/screen at a time (e.g., mouse, single finger on a touch screen, stylus). Single pointer interactions include clicks, double clicks, taps, dragging motions, and single-finger swipe gestures.", "essential": "If removed, would fundamentally change the information or functionality of the content, AND information and functionality cannot be achieved in another way that would conform."}}, "pricing": {}, "features": [{"name": "Single-Pointer Alternatives for Complex Gestures", "description": "Content must provide alternative methods for functionality that uses multipoint or path-based gestures. These alternatives should be operable with a single pointer, simplifying interaction for users who struggle with complex movements. Examples of single-pointer operations include tap, click, double tap, double click, long press, or click & hold.", "examples": ["Map view: Pinch to zoom supported, but also offers plus/minus buttons or double-tap, hold, and move pointer up/down to zoom.", "Horizontal content slider: Supports fast horizontal swipe/flicking, but also provides forward/backward arrow buttons for single-point activation.", "Kanban widget: Allows right/left swipe to move elements, but also supports selecting an element with a single tap/click and activating an arrow button to move it.", "Custom slider: Requires strict left/right drag, but also provides buttons on both sides to increment/decrement the value."]}, {"name": "Accessibility Accommodations for Motor Impairments", "description": "The criterion ensures content can be controlled with a range of pointing devices, abilities, and assistive technologies. It addresses challenges for individuals who cannot perform precise movements or rely on specialized input devices. These users may find complex gestures difficult or impossible. Providing simple, single-point actions makes content accessible for users of head pointers, eye-gaze systems, speech-controlled mouse emulators, or those who type and point with a single finger or stick.", "benefits": ["Users who cannot accurately perform path-based or multi-pointer gestures will have alternative means.", "Users operating with alternative input devices (e.g., head pointer) will have single-pointer options.", "Users who may not understand custom gesture interactions can rely on simple, frequently used gestures (beneficial for cognitive/learning disabilities)."]}, {"name": "Alternatives to Path-Based Gestures", "description": "Functionality using path-based gestures (where the pointer's movement path, not just start/end points, matters) must have a single-pointer alternative that does not involve a path-based gesture. Dragging is explicitly noted as not path-based if only start/end points matter, though alternative non-dragging methods are encouraged for fine motor control. Only when a path-based gesture is 'essential' is an alternative not strictly required.", "distinction_from_dragging": "Dragging is a movement where the user picks up an object and moves it without requiring a particular path or direction, therefore it is not path-based. This contrasts with path-based gestures which require traversal of an intermediate point, indicating directionality/speed matters. Dragging is covered by SC 2.5.7: Dragging Movements."}], "statistics": {}, "temporal_info": {"new_in_wcag": "SC 2.5.7: Dragging Movements (related to dragging differentiation) is new in WCAG 2.2."}, "geographical_data": {}, "references": [{"type": "Sufficient Techniques", "list": ["G215: Providing controls to achieve the same result as path based or multipoint gestures", "G216: Providing single point activation for a control slider"]}, {"type": "Failures", "list": ["F105: Failure of Success Criterion 2.5.1 due to providing functionality via a path-based gesture without simple pointer alternative"]}, {"type": "Related Success Criterion", "list": ["SC 2.5.7: Dragging Movements"]}]}