{"raw_content": "{\n  \"data\": {\n    \"extracted_information\": \"Detailed specifications for minimum touch target sizes as per WCAG 2.2 Success Criterion 2.5.8 (Target Size - Minimum) at Level AA.\",\n    \"specifications\": {\n      \"minimum_target_size\": \"24 by 24 CSS pixels\",\n      \"measurement_method\": \"Conceptually possible to draw a solid 24 by 24 CSS pixel square, aligned to the horizontal and vertical axis, completely within the target's area. If a target is not large enough to contain this square, it is considered 'undersized'.\",\n      \"css_pixel_definition\": \"Visual angle of about 0.0213 degrees. A canonical unit of measure for all lengths and measurements in CSS, density-independent, distinct from hardware pixels. User agents and operating systems ensure it aligns with the CSS Values and Units Module Level 3 reference pixel.\",\n      \"minimum_spacing_alternative\": \"If targets are undersized (less than 24 by 24 CSS pixels), they must be positioned so that if a 24 CSS pixel diameter circle is centered on the bounding box of each, these circles do not intersect another target or the circle for another undersized target.\",\n      \"bounding_box_definition\": \"The smallest enclosing rectangle aligned to the horizontal axis within which all the points of a shape lie. For components wrapping onto multiple lines, the bounding box is based on how the component would appear on a single line.\",\n      \"pointer_input\": \"Input from a device that can target a specific coordinate (or set of coordinates) on a screen, such as a mouse, pen, or touch contact.\"\n    },\n    \"exceptions\": [\n      {\n        \"name\": \"Spacing\",\n        \"details\": \"Undersized targets (less than 24 by 24 CSS pixels) are positioned so that if a 24 CSS pixel diameter circle is centered on the bounding box of each, the circles do not intersect another target or the circle for another undersized target.\"\n      },\n      {\n        \"name\": \"Equivalent\",\n        \"details\": \"The function can be achieved through a different control on the same page that meets the 24x24 CSS pixels criterion.\"\n      },\n      {\n        \"name\": \"Inline\",\n        \"details\": \"The target is in a sentence or its size is otherwise constrained by the line-height of non-target text. This is allowed because text reflow makes anticipating link positions difficult, and applying the criterion can result in undesirable design. Line-height should be interpreted perpendicular to text flow.\"\n      },\n      {\n        \"name\": \"User Agent Control\",\n        \"details\": \"The size of the target is determined by the user agent (e.g., browser's default scrollbars or calendar controls) and is not modified by the author. If modified by the author, appropriate spacing must be ensured.\"\n      },\n      {\n        \"name\": \"Essential\",\n        \"details\": \"A particular presentation of the target is essential or is legally required for the information being conveyed. Examples include digital maps where pin position is crucial (even if dense), interactive data visualizations, or legal requirements to replicate paper forms with small targets. Authors are strongly encouraged to provide equivalent functionality through alternative means when this exception applies.\"\n      }\n    ],\n    \"features\": [\n      \"Helps users with dexterity limitations (e.g., hand tremors, spasticity, quadriplegia) and those with difficulty with fine motor movement.\",\n      \"Benefits users of specialized input devices that lack the accuracy of mainstream pointing devices.\",\n      \"Improves usability for touchscreen interfaces.\",\n      \"Reduces accidental activation of adjacent targets.\",\n      \"Independent of page zoom factor; authors cannot rely on user zoom to meet the requirement.\",\n      \"Does not apply to targets obscured by content displayed as a result of user interaction (e.g., dropdowns from comboboxes, modal dialogs, cookie banners after page load, 'Take a survey' dialogs after inactivity).\",\n      \"Applies to targets in any new content that appears on top of other content.\"\n    },\n    \"statistics\": {},\n    \"temporal_info\": {},\n    \"geographical_data\": {},\n    \"references\": [\n      \"WAI | W3C: Understanding Success Criterion 2.5.8: Target Size (Minimum)\",\n      \"WCAG 2.2 Success Criterion 2.5.8: Target Size (Minimum) (Level AA)\",\n      \"Target Size (Enhanced) (SC 2.5.5)\",\n      \"C42: Using min-height and min-width to ensure sufficient target spacing (WCAG Techniques)\",\n      \"Target size study for one-handed thumb use on small touchscreen devices (dl.acm.org)\",\n      \"CSS Values and Units Module Level 3 reference pixel (W3C)\",\n      \"Pointer Events definition for 'pointer' (W3C)\"\n    ]\n  }\n}"}