{"extracted_information": "The provided content primarily details color-blindness as a visual disability and offers design considerations for web content to accommodate it. It thoroughly explains various types of color-blindness and emphasizes that color should not be the sole method for conveying information.", "specifications": {"color_vision_deficiencies": {"red_green_deficiencies": {"description": "Difficulty distinguishing between some shades of reds and greens. Can differentiate based on luminance. Reds and greens may appear as yellows, oranges, and beiges. Blue is not affected.", "types": {"protanopia_and_protanomaly": {"cause": "Cones primarily responsible for detecting red are missing or malfunctioning.", "effect": "Greens tend to look like reds. Reds tend to look darker. Protanomaly is milder than protanopia.", "example_perception": "Indistinguishable reds and greens, reds slightly darker."}, "deuteranopia_and_deuteranomaly": {"cause": "Cones primarily responsible for detecting green are missing or malfunctioning.", "effect": "Similar to protanopia, but reds do not appear as dark. Deuteranomaly is less serious, often allowing individuals to distinguish reds and greens relatively accurately.", "example_perception": "Indistinguishable reds and greens."}}}, "other_deficiencies": {"tritanopia_and_tritanomaly": {"prevalence": "Much less common.", "cause": "Cones primarily responsible for detecting blue are missing or malfunctioning.", "effect": "Blues and greens may appear very similar. Yellows may appear as lighter shades of red or disappear completely.", "example_perception": "Blues and greens difficult to distinguish."}, "rod_monochromacy_or_achromatopsia": {"prevalence": "Extremely small minority.", "cause": "All three types of cones are either missing or non-functional; only rods (detect light intensity) are available for visual information.", "effect": "See the world in grayscale (black, white, shades of gray). Often results in poor visual acuity and aversion to bright light. This is true 'color blindness'.", "example_perception": "Image appears without any color, blurrier and lighter."}}}}, "pricing": {}, "features": [], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": [], "visual_accessibility": {"color_blindness_support": {"design_principles": ["Do not rely solely on color to convey important information. If colors are used for differentiation (e.g., charts, pass/fail indicators), provide the information in an alternative way.", "Consider that individuals who are blind are also color-blind.", "When color information is crucial and not perceived (by color-blind users, or overridden by custom settings), supplement the information by:", "- Annotating the image.", "- Using different styles or contrasts for elements (e.g., lines on a map).", "- Supplementing the image with text on the web page that conveys the same information."]}, "low_vision_accommodations": null, "screen_reader_requirements": null}}