{"extracted_information": "Web Content Accessibility Guidelines (WCAG) 2.1 provides recommendations for making web content more accessible to a wider range of people with disabilities, including accommodations for blindness and low vision, deafness and hearing loss, limited movement, speech disabilities, photosensitivity, and combinations of these, and some accommodation for learning disabilities and cognitive limitations. It builds on WCAG 2.0 and introduces new success criteria. Conformance levels are A (lowest), AA, and AAA (highest). Conformance to Level AA implies satisfying all Level A and AA criteria. Conformance to Level AAA implies satisfying all Level A, AA, and AAA criteria.", "specifications": {"color_contrast": {"text_and_images_of_text_minimum_aa": "4.5:1 (except large text, incidental, logotypes)", "large_text_minimum_aa": "3:1 (large-scale text and images of large-scale text)", "text_and_images_of_text_enhanced_aaa": "7:1 (except large text, incidental, logotypes)", "large_text_enhanced_aaa": "4.5:1 (large-scale text and images of large-scale text)", "non_text_contrast_aa": "3:1 against adjacent color(s) for visual information required to identify user interface components/states and parts of graphics required to understand content (except inactive components, user agent determined, or essential presentation)", "definition_contrast_ratio": "(L1 + 0.05) / (L2 + 0.05), where L1 is relative luminance of lighter color, L2 is relative luminance of darker color. Range from 1 to 21 (1:1 to 21:1)."}, "font_sizing": {"resize_text_aa": "Text can be resized without assistive technology up to 200% without loss of content or functionality (except captions and images of text).", "text_spacing_aa": {"line_height": "at least 1.5 times the font size", "paragraph_spacing": "at least 2 times the font size (spacing following paragraphs)", "letter_spacing_tracking": "at least 0.12 times the font size", "word_spacing": "at least 0.16 times the font size"}, "visual_presentation_aaa": {"text_resize_without_horizontal_scroll": "Text can be resized without assistive technology up to 200% in a way that does not require the user to scroll horizontally to read a line of text on a full-screen window.", "width_of_blocks_of_text": "no more than 80 characters or glyphs (40 if CJK)", "text_justification": "Text is not justified (aligned to both left and right margins).", "line_spacing_leading": "at least space-and-a-half within paragraphs", "paragraph_spacing_visual_presentation": "at least 1.5 times larger than the line spacing"}, "large_text_definition": "at least 18 point or 14 point bold, or font size that would yield equivalent size for Chinese, Japanese and Korean (CJK) fonts."}, "touch_targets": {"target_size_aaa": "At least 44 by 44 CSS pixels (except when equivalent target available, target is inline, user agent control, or essential presentation)."}}, "features": [], "statistics": {}, "temporal_info": {"publication_date": "Not explicitly stated, but errata mentions December 2024 and September 2023 versions, indicating ongoing updates. Original WCAG 2.1 published June 2018."}, "geographical_data": {}, "references": [], "compliance_requirements": {"level_aa": {"description": "Satisfies all Level A and Level AA success criteria.", "success_criteria": [{"id": "1.1.1", "name": "Non-text Content", "level": "A", "disabilities_addressed": ["blindness", "low_vision"], "description": "All non-text content that is presented to the user has a text alternative that serves the equivalent purpose, except for certain exceptions (controls, time-based media, test, sensory, CAPTCHA, decoration/formatting/invisible)."}, {"id": "1.2.1", "name": "Audio-only and Video-only (Prerecorded)", "level": "A", "disabilities_addressed": ["deafness", "hearing_loss"], "description": "For prerecorded audio-only and video-only media, provide alternative for time-based media or an audio track that presents equivalent information."}, {"id": "1.2.2", "name": "Captions (Prerecorded)", "level": "A", "disabilities_addressed": ["deafness", "hearing_loss"], "description": "Captions are provided for all prerecorded audio content in synchronized media, except when a media alternative for text."}, {"id": "1.2.3", "name": "Audio Description or Media Alternative (Prerecorded)", "level": "A", "disabilities_addressed": ["blindness", "low_vision"], "description": "An alternative for time-based media or audio description of prerecorded video content is provided for synchronized media, except when a media alternative for text."}, {"id": "1.2.4", "name": "Captions (Live)", "level": "AA", "disabilities_addressed": ["deafness", "hearing_loss"], "description": "Captions are provided for all live audio content in synchronized media."}, {"id": "1.2.5", "name": "Audio Description (Prerecorded)", "level": "AA", "disabilities_addressed": ["blindness", "low_vision"], "description": "Audio description is provided for all prerecorded video content in synchronized media."}, {"id": "1.3.1", "name": "Info and Relationships", "level": "A", "disabilities_addressed": ["blindness", "low_vision", "cognitive", "learning"], "description": "Information, structure, and relationships conveyed through presentation can be programmatically determined or are available in text."}, {"id": "1.3.2", "name": "Meaningful Sequence", "level": "A", "disabilities_addressed": ["blindness", "cognitive", "learning"], "description": "When the sequence in which content is presented affects its meaning, a correct reading sequence can be programmatically determined."}, {"id": "1.3.3", "name": "Sensory Characteristics", "level": "A", "disabilities_addressed": ["blindness", "low_vision", "cognitive"], "description": "Instructions provided for understanding and operating content do not rely solely on sensory characteristics of components such as shape, color, size, visual location, orientation, or sound."}, {"id": "1.3.4", "name": "Orientation", "level": "AA", "disabilities_addressed": ["low_vision", "mobile_users", "cognitive"], "description": "Content does not restrict its view and operation to a single display orientation, such as portrait or landscape, unless a specific display orientation is essential."}, {"id": "1.3.5", "name": "Identify Input Purpose", "level": "AA", "disabilities_addressed": ["cognitive", "learning"], "description": "The purpose of each input field collecting information about the user can be programmatically determined when the input field serves a purpose identified in the Input Purposes section and the content is implemented with support for identifying expected meaning for form input data."}, {"id": "1.4.1", "name": "Use of Color", "level": "A", "disabilities_addressed": ["color_blindness", "low_vision"], "description": "Color is not used as the only visual means of conveying information, indicating an action, prompting a response, or distinguishing a visual element."}, {"id": "1.4.2", "name": "Audio Control", "level": "A", "disabilities_addressed": ["cognitive", "hearing_loss"], "description": "If any audio on a web page plays automatically for more than 3 seconds, either a mechanism is available to pause or stop the audio, or to control audio volume independently from the overall system volume level."}, {"id": "1.4.3", "name": "Contrast (Minimum)", "level": "AA", "disabilities_addressed": ["low_vision", "color_blindness"], "description": "The visual presentation of text and images of text has a contrast ratio of at least 4.5:1, or 3:1 for large text. Exceptions for incidental text or logotypes."}, {"id": "1.4.4", "name": "Resize Text", "level": "AA", "disabilities_addressed": ["low_vision"], "description": "Except for captions and images of text, text can be resized without assistive technology up to 200 percent without loss of content or functionality."}, {"id": "1.4.5", "name": "Images of Text", "level": "AA", "disabilities_addressed": ["low_vision"], "description": "If technologies can achieve visual presentation, text is used to convey information rather than images of text, unless customizable or essential."}, {"id": "1.4.10", "name": "Reflow", "level": "AA", "disabilities_addressed": ["low_vision", "mobile_users"], "description": "Content can be presented without loss of information or functionality, and without requiring scrolling in two dimensions for vertical scrolling content at a width equivalent to 320 CSS pixels; horizontal scrolling content at a height equivalent to 256 CSS pixels, except for parts requiring two-dimensional layout for usage or meaning."}, {"id": "1.4.11", "name": "Non-Text Contrast", "level": "AA", "disabilities_addressed": ["low_vision", "color_blindness"], "description": "The visual presentation of user interface components and graphical objects required to understand content have a contrast ratio of at least 3:1 against adjacent color(s)."}, {"id": "1.4.12", "name": "Text Spacing", "level": "AA", "disabilities_addressed": ["low_vision", "cognitive", "reading_disabilities"], "description": "No loss of content or functionality occurs by setting line height to at least 1.5x font size, spacing following paragraphs to at least 2x font size, letter spacing to at least 0.12x font size, and word spacing to at least 0.16x font size, in markup languages supporting these properties."}, {"id": "1.4.13", "name": "Content on Hover or Focus", "level": "AA", "disabilities_addressed": ["low_vision", "cognitive", "motor_impairment"], "description": "Where receiving and then removing pointer hover or keyboard focus triggers additional content, it must be dismissible, hoverable, and persistent."}, {"id": "2.1.1", "name": "Keyboard", "level": "A", "disabilities_addressed": ["limited_movement", "blindness"], "description": "All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes, except where underlying function requires path-dependent input."}, {"id": "2.1.2", "name": "No Keyboard Trap", "level": "A", "disabilities_addressed": ["limited_movement", "blindness"], "description": "If keyboard focus can be moved to a component using a keyboard interface, then focus can be moved away from that component using only a keyboard interface. If more than standard keys, user is advised of method."}, {"id": "2.1.4", "name": "Character Key Shortcuts", "level": "A", "disabilities_addressed": ["limited_movement", "cognitive"], "description": "If a keyboard shortcut uses only letter, punctuation, number, or symbol characters, then a mechanism is available to turn it off, remap it to include non-printable keys, or it's active only on focus."}, {"id": "2.2.1", "name": "Timing Adjustable", "level": "A", "disabilities_addressed": ["cognitive", "limited_movement"], "description": "For each time limit set by content, user can turn off, adjust over a wide range (at least 10x default), or extend (warned, 20 seconds to extend, at least 10 times). Exceptions for real-time, essential, or longer than 20 hours."}, {"id": "2.2.2", "name": "Pause, Stop, Hide", "level": "A", "disabilities_addressed": ["cognitive", "photosensitivity"], "description": "For moving, blinking, scrolling, or auto-updating information that starts automatically, lasts more than five seconds, and is presented in parallel with other content, there is a mechanism to pause, stop, or hide it or control update frequency, unless essential."}, {"id": "2.3.1", "name": "Three Flashes or Below Threshold", "level": "A", "disabilities_addressed": ["photosensitivity"], "description": "Web pages do not contain anything that flashes more than three times in any one second period, or the flash is below the general flash and red flash thresholds."}, {"id": "2.5.1", "name": "Pointer Gestures", "level": "A", "disabilities_addressed": ["limited_movement", "mobile_users"], "description": "All functionality that uses multipoint or path-based gestures can be operated with a single pointer without a path-based gesture, unless essential."}, {"id": "2.5.2", "name": "Pointer Cancellation", "level": "A", "disabilities_addressed": ["limited_movement", "mobile_users"], "description": "For functionality operated by a single pointer, either the down-event is not used to execute, or completion is on up-event with abort/undo mechanism, or up-event reverses preceding down-event, unless essential."}, {"id": "2.5.3", "name": "Label in Name", "level": "A", "disabilities_addressed": ["speech", "cognitive"], "description": "For UI components with labels including text or images of text, the name contains the text that is presented visually."}, {"id": "2.5.4", "name": "Motion Actuation", "level": "A", "disabilities_addressed": ["limited_movement", "mobile_users"], "description": "Functionality operated by device motion or user motion can also be operated by UI components, and responding to motion can be disabled to prevent accidental actuation, unless accessible interface or essential."}, {"id": "3.1.1", "name": "Language of Page", "level": "A", "disabilities_addressed": ["cognitive", "learning", "blindness"], "description": "The default human language of each web page can be programmatically determined."}, {"id": "3.1.2", "name": "Language of Parts", "level": "AA", "disabilities_addressed": ["cognitive", "learning", "blindness"], "description": "The human language of each passage or phrase in the content can be programmatically determined, except for proper names, technical terms, words of indeterminate language, and vernacular phrases."}, {"id": "3.2.1", "name": "On Focus", "level": "A", "disabilities_addressed": ["cognitive", "limited_movement"], "description": "When any user interface component receives focus, it does not initiate a change of context."}, {"id": "3.2.2", "name": "On Input", "level": "A", "disabilities_addressed": ["cognitive", "limited_movement"], "description": "Changing the setting of any user interface component does not automatically cause a change of context unless the user has been advised of the behavior before using the component."}, {"id": "3.2.4", "name": "Consistent Identification", "level": "AA", "disabilities_addressed": ["cognitive", "learning"], "description": "Components that have the same functionality within a set of web pages are identified consistently."}, {"id": "3.3.1", "name": "Error Identification", "level": "A", "disabilities_addressed": ["cognitive", "learning"], "description": "If an input error is automatically detected, the item in error is identified and the error is described to the user in text."}, {"id": "3.3.2", "name": "Labels or Instructions", "level": "A", "disabilities_addressed": ["cognitive", "learning"], "description": "Labels or instructions are provided when content requires user input."}, {"id": "3.3.3", "name": "Error Suggestion", "level": "AA", "disabilities_addressed": ["cognitive", "learning"], "description": "If an input error is automatically detected and suggestions for correction are known, then the suggestions are provided to the user, unless it would jeopardize security or purpose of content."}, {"id": "3.3.4", "name": "Error Prevention (Legal, Financial, Data)", "level": "AA", "disabilities_addressed": ["cognitive", "learning"], "description": "For web pages causing legal commitments or financial transactions, modifying/deleting user data, or submitting user test responses, at least one of reversible, checked, or confirmed mechanism is available."}, {"id": "4.1.1", "name": "Parsing", "level": "A", "disabilities_addressed": ["assistive_technology_users"], "description": "In content implemented using markup languages, elements have complete start and end tags, are nested according to specifications, do not contain duplicate attributes, and any IDs are unique, except where specifications allow. (Note: HTML/XML generally satisfy this due to user agent handling.)"}, {"id": "4.1.2", "name": "Name, Role, Value", "level": "A", "disabilities_addressed": ["assistive_technology_users"], "description": "For all user interface components, the name and role can be programmatically determined; states, properties, and values that can be set by the user can be programmatically set; and notification of changes to these items is available to user agents, including assistive technologies."}, {"id": "4.1.3", "name": "Status Messages", "level": "AA", "disabilities_addressed": ["blindness", "low_vision", "cognitive"], "description": "In content implemented using markup languages, status messages can be programmatically determined through role or properties such that they can be presented to the user by assistive technologies without receiving focus."}]}, "level_aaa": {"description": "Satisfies all Level A, Level AA, and Level AAA success criteria. (Note: Level AAA conformance is not recommended as a general policy for entire sites because it is not possible to satisfy all Level AAA success criteria for some content.)", "success_criteria": [{"id": "1.2.6", "name": "Sign Language (Prerecorded)", "level": "AAA", "disabilities_addressed": ["deafness", "hearing_loss"], "description": "Sign language interpretation is provided for all prerecorded audio content in synchronized media."}, {"id": "1.2.7", "name": "Extended Audio Description (Prerecorded)", "level": "AAA", "disabilities_addressed": ["blindness", "low_vision"], "description": "Where pauses in foreground audio are insufficient to allow audio descriptions to convey the sense of the video, extended audio description is provided for all prerecorded video content in synchronized media."}, {"id": "1.2.8", "name": "Media Alternative (Prerecorded)", "level": "AAA", "disabilities_addressed": ["blindness", "low_vision", "deafness", "hearing_loss"], "description": "An alternative for time-based media is provided for all prerecorded synchronized media and for all prerecorded video-only media."}, {"id": "1.2.9", "name": "Audio-only (Live)", "level": "AAA", "disabilities_addressed": ["deafness", "hearing_loss"], "description": "An alternative for time-based media that presents equivalent information for live audio-only content is provided."}, {"id": "1.3.6", "name": "Identify Purpose", "level": "AAA", "disabilities_addressed": ["cognitive", "learning"], "description": "In content implemented using markup languages, the purpose of user interface components, icons, and regions can be programmatically determined."}, {"id": "1.4.6", "name": "Contrast (Enhanced)", "level": "AAA", "disabilities_addressed": ["low_vision", "color_blindness"], "description": "The visual presentation of text and images of text has a contrast ratio of at least 7:1, or 4.5:1 for large text. Exceptions for incidental text or logotypes."}, {"id": "1.4.7", "name": "Low or No Background Audio", "level": "AAA", "disabilities_addressed": ["hearing_loss", "cognitive"], "description": "For prerecorded audio-only content primarily with foreground speech (not CAPTCHA/logo/musical), either no background sounds, background sounds can be turned off, or background sounds are at least 20 dB lower than foreground speech content."}, {"id": "1.4.8", "name": "Visual Presentation", "level": "AAA", "disabilities_addressed": ["low_vision", "cognitive"], "description": "For visual presentation of blocks of text, a mechanism is available to achieve: user selectable foreground/background colors, width no more than 80 chars (40 if CJK), text not justified, line spacing at least 1.5x within paragraphs, paragraph spacing at least 1.5x line spacing, and text can be resized up to 200% without horizontal scroll on full-screen window."}, {"id": "1.4.9", "name": "Images of Text (No Exception)", "level": "AAA", "disabilities_addressed": ["low_vision"], "description": "Images of text are only used for pure decoration or where a particular presentation of text is essential to the information being conveyed."}, {"id": "2.1.3", "name": "Keyboard (No Exception)", "level": "AAA", "disabilities_addressed": ["limited_movement", "blindness"], "description": "All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes."}, {"id": "2.2.3", "name": "No Timing", "level": "AAA", "disabilities_addressed": ["cognitive", "limited_movement"], "description": "Timing is not an essential part of the event or activity presented by the content, except for non-interactive synchronized media and real-time events."}, {"id": "2.2.4", "name": "Interruptions", "level": "AAA", "disabilities_addressed": ["cognitive", "attention_deficits"], "description": "Interruptions can be postponed or suppressed by the user, except interruptions involving an emergency."}, {"id": "2.2.5", "name": "Re-authenticating", "level": "AAA", "disabilities_addressed": ["cognitive"], "description": "When an authenticated session expires, the user can continue the activity without loss of data after re-authenticating."}, {"id": "2.2.6", "name": "Timeouts", "level": "AAA", "disabilities_addressed": ["cognitive", "privacy_security"], "description": "Users are warned of the duration of any user inactivity that could cause data loss, unless the data is preserved for more than 20 hours when the user does not take any actions."}, {"id": "2.3.2", "name": "Three Flashes", "level": "AAA", "disabilities_addressed": ["photosensitivity"], "description": "Web pages do not contain anything that flashes more than three times in any one second period."}, {"id": "2.3.3", "name": "Animation from Interactions", "level": "AAA", "disabilities_addressed": ["photosensitivity", "cognitive", "vestibular_disorders"], "description": "Motion animation triggered by interaction can be disabled, unless the animation is essential to the functionality or the information being conveyed."}, {"id": "2.5.5", "name": "Target Size", "level": "AAA", "disabilities_addressed": ["limited_movement", "mobile_users"], "description": "The size of the target for pointer inputs is at least 44 by 44 CSS pixels except for specific exceptions (equivalent, inline, user agent control, essential)."}, {"id": "2.5.6", "name": "Concurrent Input Mechanisms", "level": "AAA", "disabilities_addressed": ["limited_movement", "mobile_users"], "description": "Web content does not restrict use of input modalities available on a platform except where restriction is essential, required for security, or required to respect user settings."}, {"id": "3.1.3", "name": "Unusual Words", "level": "AAA", "disabilities_addressed": ["cognitive", "learning"], "description": "A mechanism is available for identifying specific definitions of words or phrases used in an unusual or restricted way, including idioms and jargon."}, {"id": "3.1.4", "name": "Abbreviations", "level": "AAA", "disabilities_addressed": ["cognitive", "learning"], "description": "A mechanism for identifying the expanded form or meaning of abbreviations is available."}, {"id": "3.1.5", "name": "Reading Level", "level": "AAA", "disabilities_addressed": ["cognitive", "learning"], "description": "When text requires reading ability more advanced than lower secondary education level (after removal of proper names/titles), supplemental content or a version not requiring advanced reading ability is available."}, {"id": "3.1.6", "name": "Pronunciation", "level": "AAA", "disabilities_addressed": ["cognitive", "learning"], "description": "A mechanism is available for identifying specific pronunciation of words where meaning is ambiguous without knowing pronunciation."}, {"id": "3.2.5", "name": "Change on Request", "level": "AAA", "disabilities_addressed": ["cognitive"], "description": "Changes of context are initiated only by user request or a mechanism is available to turn off such changes."}, {"id": "3.3.5", "name": "Help", "level": "AAA", "disabilities_addressed": ["cognitive", "learning"], "description": "Context-sensitive help is available."}, {"id": "3.3.6", "name": "Error Prevention (All)", "level": "AAA", "disabilities_addressed": ["cognitive", "learning"], "description": "For web pages requiring user submission of information, at least one of reversible, checked, or confirmed mechanism is available."}]}}}