{"extracted_information": "WCAG 2.2 Success Criterion 2.3.3, 'Animation from Interactions' (Level AAA), aims to prevent users from being harmed or distracted by motion. It requires that motion animation triggered by interaction can be disabled, unless the animation is essential to the functionality or information being conveyed. This is crucial for people who experience distraction or nausea from animated content, such as those with vestibular disorders. These disorders can cause dizziness, nausea, and headaches from non-essential motion effects like parallax scrolling.", "specifications": {"level": "AAA", "criterion_id": "2.3.3", "criterion_name": "Animation from Interactions", "definition": "Motion animation triggered by interaction can be disabled, unless the animation is essential to the functionality or the information being conveyed."}, "pricing": {}, "features": [], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "benefits": [{"category": "Vestibular Disorder", "description": "People with vestibular disorders need control over movement triggered by interactions. Non-essential movement can trigger vestibular disorder reactions including distraction, dizziness, headaches, and nausea. Preventing these reactions allows users to concentrate and avoid severe physical discomfort requiring recovery time."}], "implementation_guidance": {"goal": "Users are not harmed or distracted by motion.", "what_to_do": "Support user preferences for motion, and eliminate unnecessary motion effects.", "reducing_vestibular_disorder_triggers": ["Avoid using unnecessary animation.", "Provide a control for users to turn off non-essential animations from user interaction.", "Take advantage of the reduce motion feature in the user agent or operating system."], "scroll_movement": "Moving new content into the viewport is essential for scrolling. Only add non-essential animation to the scrolling interaction in a responsible way. Always give users the ability to turn off unnecessary movement.", "sufficient_techniques": ["C39: Using the CSS reduce-motion query to prevent motion", "Allowing users to set a preference that prevents animation."]}, "examples": [{"name": "Parallax scrolling with option to turn off unnecessary motion globally", "description": "A site includes extra animations (e.g., decorative elements moving horizontally while content scrolls vertically). A site-wide control allows users to turn off these unnecessary animations."}, {"name": "Transitions that support the reduce motion preference", "description": "A site uses a non-essential transition (e.g., page-flipping animation) when loading new content. This transition respects the 'prefers-reduced-motion' CSS media query, turning off the animation when the user enables the reduce motion preference."}, {"name": "Essential animation", "description": "A web application provides a feature to author animated sequences where previewing the animation is essential to the tool's functionality."}], "key_terms": {"essential": "if removed, would fundamentally change the information or functionality of the content, AND information and functionality cannot be achieved in another way that would conform.", "motion_animation": "addition of steps between conditions to create the illusion of movement or to give a sense of a smooth transition."}, "references": ["Mozilla documentation for 'prefers-reduced-motion' (developer.mozilla.org/en-US/docs/Web/CSS/@media/prefers-reduced-motion)", "Demonstration of 'prefers-reduced-motion' in Webkit (webkit.org/blog-files/prefers-reduced-motion/prm.htm)", "An Introduction to the Reduced Motion Media Query (css-tricks.com/introduction-reduced-motion-media-query/)", "Designing Safer Web Animations for Motion Sensitivity (alistapart.com/article/designing-safer-web-animation-for-motion-sensitivity)", "iOS: Reduce Motion on iPhone, iPad or iPod touch (support.apple.com/en-gb/HT202655)", "Mac: Reduce Motion (apple.stackexchange.com/questions/253756/speed-up-mission-control-animations-in-macos-sierra)", "Windows 10: Reduce motion (laptopmag.com/articles/disable-minimize-maximize-animations-windows-10)"]}